---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.AnalyticalSystemDomain
source: html/01a07a9f-5cea-42e2-6630-88a032e88f85.htm
---
# Autodesk.Revit.DB.Mechanical.AnalyticalSystemDomain

The domain type of analytical system.

## Syntax (C#)
```csharp
public enum AnalyticalSystemDomain
```